multicomponentFluid/membrane/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    membrane
    {
        type        faceZone;
        zoneName    membrane;

        owner
        {
            name        membranePipe;
            type        mappedWall;
            neighbourPatch membraneSleeve;
        }

        neighbour
        {
            name        membraneSleeve;
            type        mappedWall;
            neighbourPatch membranePipe;
        }
    }
}


// ************************************************************************* //
